Repository: wolfwdavid/cross_platform_c11
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, uk, zh_hans, zh_hant

# settings.browser.externalPatterns.subtitle
source: Applies to terminal link clicks and intercepted `open https://...` calls. One rule per line. Plain text matches any URL substring; prefix with `re:` for regex (example: openai.com/usage, re:^https?://[^/]*\\.example\\.com/(billing|usage)).
ja: ターミナルのリンククリックおよびインターセプトされた`open https://...`呼び出しに適用されます。1行に1ルール。プレーンテキストはURLの部分文字列に一致。`re:`プレフィックスで正規表現（例: openai.com/usage, re:^https?://[^/]*\\.example\\.com/(billing|usage)）。
ko: 터미널 링크 클릭 및 인터셉트된 `open https://...` 호출에 적용됩니다. 한 줄에 하나의 규칙. 일반 텍스트는 URL 하위 문자열을 일치시키며, 정규식은 `re:` 접두사를 사용합니다 (예: openai.com/usage, re:^https?://[^/]*\\.example\\.com/(billing|usage)).
ru: Применяется к нажатиям ссылок в терминале и перехваченным вызовам `open https://...`. Одно правило на строку. Обычный текст совпадает с любой подстрокой URL; префикс `re:` — регулярное выражение (например: openai.com/usage, re:^https?://[^/]*\\.example\\.com/(billing|usage)).
uk: Застосовується до кліків на посилання в терміналі й перехоплених викликів `open https://...`. Одне правило на рядок. Звичайний текст збігається з будь-яким підрядком URL; префікс `re:` для регулярного виразу (приклад: openai.com/usage, re:^https?://[^/]*\\.example\\.com/(billing|usage)).
zh_hans: 适用于终端链接点击和拦截的 `open https://...` 调用。每行一条规则。纯文本匹配任意 URL 子串；使用 `re:` 前缀表示正则表达式（例如：openai.com/usage、re:^https?://[^/]*\\.example\\.com/(billing|usage)）。
zh_hant: 套用於終端機連結點擊和攔截的 `open https://...` 呼叫。每行一條規則。純文字比對 URL 的任何子字串；加上 `re:` 前綴使用正規表示式（例如：openai.com/usage、re:^https?://[^/]*\\.example\\.com/(billing|usage)）。

# settings.browser.history
source: Browsing History
ja: ブラウザ履歴
ko: 탐색 기록
ru: История просмотра
uk: Історія перегляду
zh_hans: 浏览历史
zh_hant: 瀏覽記錄

# settings.browser.history.clearButton
source: Clear History…
ja: 履歴をクリア…
ko: 기록 지우기…
ru: Очистить историю...
uk: Очистити історію…
zh_hans: 清除历史记录...
zh_hant: 清除記錄...

# settings.browser.history.clearDialog.cancel
source: Cancel
ja: キャンセル
ko: 취소
ru: Отменить
uk: Скасувати
zh_hans: 取消
zh_hant: 取消

# settings.browser.history.clearDialog.confirm
source: Clear History
ja: 履歴をクリア
ko: 기록 지우기
ru: Очистить историю
uk: Очистити історію
zh_hans: 清除历史记录
zh_hant: 清除記錄

# settings.browser.history.clearDialog.message
source: Removes visited-page suggestions from the omnibar.
ja: オムニバーから訪問済みページの候補を削除します。
ko: 옴니바에서 방문 페이지 제안을 제거합니다.
ru: Удаляет подсказки посещённых страниц из адресной строки.
uk: Прибирає пропозиції відвіданих сторінок з омнібара.
zh_hans: 从地址栏中移除已访问页面的建议。
zh_hant: 移除網址列中已造訪頁面的建議。

# settings.browser.history.clearDialog.title
source: Clear browser history?
ja: ブラウザ履歴をクリアしますか？
ko: 브라우저 기록을 지우시겠습니까?
ru: Очистить историю браузера?
uk: Очистити історію браузера?
zh_hans: 清除浏览器历史记录？
zh_hant: 要清除瀏覽記錄嗎？

# settings.browser.history.subtitleEmpty
source: No saved pages yet.
ja: 保存済みのページはまだありません。
ko: 아직 저장된 페이지가 없습니다.
ru: Сохраненных страниц пока нет.
uk: Збережених сторінок ще немає.
zh_hans: 尚无已保存的页面。
zh_hant: 尚無已儲存的頁面。

# settings.browser.history.subtitleMany
source: %lld saved pages appear in omnibar suggestions.
ja: %lld件の保存済みページがオムニバーの候補に表示されます。
ko: %lld개의 저장된 페이지가 옴니바 제안에 표시됩니다.
ru: Сохраненных страниц: %lld. Отображаются в подсказках адресной строки.
uk: Збережених сторінок: %lld. З'являються у пропозиціях омнібара.
zh_hans: %lld 个已保存页面显示在地址栏建议中。
zh_hant: %lld 個已儲存頁面會出現在網址列建議中。

# settings.browser.history.subtitleOne
source: 1 saved page appears in omnibar suggestions.
ja: 1件の保存済みページがオムニバーの候補に表示されます。
ko: 1개의 저장된 페이지가 옴니바 제안에 표시됩니다.
ru: 1 сохраненная страница отображается в подсказках адресной строки.
uk: 1 збережена сторінка з'являється у пропозиціях омнібара.
zh_hans: 1 个已保存页面显示在地址栏建议中。
zh_hant: 1 個已儲存頁面會出現在網址列建議中。

# settings.browser.hostWhitelist
source: Hosts to Open in Embedded Browser
ja: 内蔵ブラウザで開くホスト
ko: 내장 브라우저에서 열 호스트
ru: Хосты для открытия во встроенном браузере
uk: Хости для відкриття у вбудованому браузері
zh_hans: 在内嵌浏览器中打开的主机
zh_hant: 在內建瀏覽器中開啟的主機

# settings.browser.hostWhitelist.subtitle
source: Applies to terminal link clicks and intercepted `open https://...` calls. Only these hosts open in c11; the rest go to your default browser. One host or wildcard per line (example: example.com, *.internal.example). Leave empty to open every host in c11.
ja: ターミナルのリンククリックおよびインターセプトされた`open https://...`呼び出しに適用されます。c11で開くのはこれらのホストのみ。その他はデフォルトブラウザへ。1行に1つのホストまたはワイルドカード（例: example.com, *.internal.example）。空欄にするとすべてのホストをc11で開きます。
ko: 터미널 링크 클릭 및 인터셉트된 `open https://...` 호출에 적용됩니다. 이 호스트만 c11에서 열리고, 나머지는 기본 브라우저로 갑니다. 한 줄에 하나의 호스트 또는 와일드카드 (예: example.com, *.internal.example). 비워두면 모든 호스트가 c11에서 열립니다.
ru: Применяется к нажатиям ссылок в терминале и перехваченным вызовам `open https://...`. Только эти хосты открываются в c11; остальные — в браузере по умолчанию. Один хост или шаблон на строку (например: example.com, *.internal.example). Оставьте пустым, чтобы открывать все хосты в c11.
uk: Застосовується до кліків на посилання в терміналі й перехоплених викликів `open https://...`. Лише ці хости відкриваються в c11; решта — у стандартному браузері. Один хост або шаблон на рядок (приклад: example.com, *.internal.example). Залиште порожнім, щоб усі хости відкривались у c11.
zh_hans: 适用于终端链接点击和拦截的 `open https://...` 调用。仅这些主机在 c11 中打开，其余交由默认浏览器处理。每行一个主机或通配符（例如：example.com、*.internal.example）。留空则所有主机均在 c11 中打开。
zh_hant: 套用於終端機連結點擊和攔截的 `open https://...` 呼叫。僅這些主機會在 c11 中開啟，其餘會交給預設瀏覽器。每行一個主機或萬用字元（例如：example.com、*.internal.example）。留空則所有主機都在 c11 中開啟。

# settings.browser.httpAllowlist
source: HTTP Hosts Allowed in Embedded Browser
ja: 内蔵ブラウザで許可するHTTPホスト
ko: 내장 브라우저에서 허용할 HTTP 호스트
ru: HTTP-хосты, разрешенные во встроенном браузере
uk: HTTP-хости, дозволені у вбудованому браузері
zh_hans: 内嵌浏览器中允许的 HTTP 主机
zh_hant: 允許在內建瀏覽器中使用的 HTTP 主機

# settings.browser.httpAllowlist.description
source: Which HTTP (non-HTTPS) hosts open in c11 without a warning. Defaults: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me.
ja: 警告なしでc11で開くHTTP（非HTTPS）ホスト。デフォルト: localhost、127.0.0.1、::1、0.0.0.0、*.localtest.me。
ko: c11에서 경고 없이 열리는 HTTP(비HTTPS) 호스트. 기본값: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me.
ru: Какие HTTP (не HTTPS) хосты открываются в c11 без предупреждения. По умолчанию: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me.
uk: Які HTTP-хости (не HTTPS) відкриваються в c11 без попередження. Типово: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me.
zh_hans: 哪些 HTTP（非 HTTPS）主机在 c11 中打开时不显示警告。默认：localhost、127.0.0.1、::1、0.0.0.0、*.localtest.me。
zh_hant: 哪些 HTTP（非 HTTPS）主機在 c11 中開啟而不顯示警告。預設：localhost、127.0.0.1、::1、0.0.0.0、*.localtest.me。

# settings.browser.httpAllowlist.hint
source: One host or wildcard per line (example: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
ja: 1行に1つのホストまたはワイルドカード（例: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me）。
ko: 한 줄에 하나의 호스트 또는 와일드카드 (예: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
ru: Один хост или шаблон на строку (например: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
uk: Один хост або шаблон на рядок (приклад: localhost, 127.0.0.1, ::1, 0.0.0.0, *.localtest.me).
zh_hans: 每行一个主机或通配符（例如：localhost、127.0.0.1、::1、0.0.0.0、*.localtest.me）。
zh_hant: 每行一個主機或萬用字元（例如：localhost、127.0.0.1、::1、0.0.0.0、*.localtest.me）。

# settings.browser.httpAllowlist.save
source: Save
ja: 保存
ko: 저장
ru: Сохранить
uk: Зберегти
zh_hans: 保存
zh_hant: 儲存

# settings.browser.import
source: Import Browser Data
ja: ブラウザーデータを取り込む
ko: 브라우저 데이터 가져오기
ru: Импортировать данные браузера
uk: Імпортувати дані браузера
zh_hans: 导入浏览器数据
zh_hant: 匯入瀏覽器資料

# settings.browser.import.choose
source: Choose…
ja: 選択…
ko: 선택…
ru: Выбрать…
uk: Обрати…
zh_hans: 选择…
zh_hant: 選擇…

# settings.browser.import.hint.note.hidden
source: The blank-tab import hint is hidden. Turn it back on any time.
ja: 空タブのインポート案内は非表示です。ここでいつでも再表示できます。
ko: 빈 탭의 가져오기 힌트가 숨겨져 있어요. 언제든 다시 켤 수 있어요.
ru: Подсказка импорта на пустой вкладке скрыта. Включите её снова в любой момент.
uk: Підказку про імпорт на порожній вкладці приховано. Увімкніть її знову в будь-який момент.
zh_hans: 空白标签上的导入提示已隐藏。随时可重新打开。
zh_hant: 空白標籤頁的匯入提示已隱藏。隨時可以重新開啟。

# settings.browser.import.hint.note.settingsOnly
source: Blank tabs are on Settings-only mode from the debug window.
ja: 空タブはデバッグウィンドウの「設定のみ」モードです。
ko: 빈 탭이 디버그 창의 설정 전용 모드로 설정되어 있습니다.
ru: Пустые вкладки работают в режиме «Только настройки» из окна отладки.
uk: Порожні вкладки працюють у режимі «лише налаштування», заданому з вікна зневадження.
zh_hans: 空白标签页通过调试窗口处于「仅设置」模式。
zh_hant: 空白分頁目前使用來自除錯視窗的「僅設定」模式。

# settings.browser.import.hint.note.visible
source: Blank browser tabs can show this import suggestion. Hide or re-enable it here.
ja: 空のブラウザータブにこのインポート案内を表示できます。ここで非表示や再表示を切り替えられます。
ko: 빈 브라우저 탭에 이 가져오기 제안을 표시할 수 있어요. 여기서 숨기거나 다시 활성화하세요.
ru: Пустые вкладки браузера могут показывать это предложение импорта. Скройте или включите её снова здесь.
uk: Порожні вкладки браузера можуть показувати цю пропозицію імпорту. Приховайте або ввімкніть її тут.
zh_hans: 空白浏览器标签可以显示这条导入建议。可在此处隐藏或重新启用。
zh_hant: 空白的瀏覽器標籤頁可顯示此匯入建議。可在這裡隱藏或重新啟用。

# settings.browser.import.hint.show
source: Show import hint on blank browser tabs
ja: 空のブラウザータブにインポート案内を表示
ko: 빈 브라우저 탭에 가져오기 힌트 표시
ru: Показывать подсказку импорта на пустых вкладках браузера
uk: Показувати підказку імпорту на порожніх вкладках браузера
zh_hans: 在空白浏览器标签上显示导入提示
zh_hant: 在空白瀏覽器標籤頁顯示匯入提示

# settings.browser.import.refresh
source: Refresh
ja: 再読み込み
ko: 새로고침
ru: Обновить
uk: Оновити
zh_hans: 刷新
zh_hant: 重新整理

# settings.browser.interceptOpen
source: Intercept open http(s) in Terminal
ja: ターミナルでopen http(s)をインターセプト
ko: 터미널에서 open http(s) 인터셉트
ru: Перехватывать open http(s) в терминале
uk: Перехоплювати open http(s) у терміналі
zh_hans: 在终端中拦截 open http(s)
zh_hant: 在終端機中攔截 open http(s)

# settings.browser.interceptOpen.subtitle
source: Off: `open https://...` and `open http://...` go to your default browser.
ja: オフ時: `open https://...`と`open http://...`はデフォルトブラウザへ。
ko: 끄면 `open https://...` 및 `open http://...`가 기본 브라우저로 갑니다.
ru: Отключено: `open https://...` и `open http://...` открываются в браузере по умолчанию.
uk: Вимкнено: `open https://...` та `open http://...` ідуть у стандартний браузер.
zh_hans: 关闭时：`open https://...` 和 `open http://...` 交由默认浏览器处理。
zh_hant: 關閉時：`open https://...` 和 `open http://...` 會交給預設瀏覽器。

# settings.browser.linkRouting.note
source: Link interception decides where terminal URL actions land. Sidebar PR links live on Workspace & Sidebar.
ja: リンクのインターセプトはターミナルのURL操作の行き先を決めます。サイドバーのPRリンクは「ワークスペースとサイドバー」にあります。
ko: 링크 인터셉션이 터미널 URL 동작의 목적지를 결정합니다. 사이드바 PR 링크는 Workspace & Sidebar에서 관리됩니다.
ru: Перехват ссылок решает, куда направлять URL из терминала. Ссылки на PR в боковой панели настраиваются в «Рабочее пространство и боковая панель».
uk: Перехоплення посилань визначає, куди потрапляють URL-дії терміналу. Посилання PR у бічній панелі — у розділі «Робочі простори та бічна панель».
zh_hans: 链接拦截决定终端 URL 操作的去向。侧边栏 PR 链接在「工作区与侧边栏」中设置。
zh_hant: 連結攔截決定終端機 URL 動作的開啟位置。側邊欄 PR 連結設定在「工作區與側邊欄」。

# settings.browser.openTerminalLinks
source: Open Terminal Links in c11 Browser
ja: ターミナルのリンクをc11ブラウザで開く
ko: 터미널 링크를 c11 브라우저에서 열기
ru: Открывать ссылки из терминала в браузере c11
uk: Відкривати посилання термінала в браузері c11
zh_hans: 在 c11 浏览器中打开终端链接
zh_hant: 在 c11 瀏覽器中開啟終端機連結

# settings.browser.openTerminalLinks.subtitle
source: Off: terminal-output links open in your default browser.
ja: オフ時: ターミナル出力のリンクはデフォルトブラウザで開きます。
ko: 끄면 터미널 출력의 링크가 기본 브라우저에서 열립니다.
ru: Отключено: ссылки из терминала открываются в браузере по умолчанию.
uk: Вимкнено: посилання з виводу терміналу відкриваються у стандартному браузері.
zh_hans: 关闭时：终端输出中的链接在默认浏览器中打开。
zh_hant: 關閉時：終端機輸出中的連結會在預設瀏覽器中開啟。

# settings.browser.searchEngine
source: Default Search Engine
ja: デフォルト検索エンジン
ko: 기본 검색 엔진
ru: Поисковая система по умолчанию
uk: Пошукова система за замовчуванням
zh_hans: 默认搜索引擎
zh_hant: 預設搜尋引擎

# settings.browser.searchEngine.subtitle
source: Used when address-bar input isn't a URL.
ja: アドレスバーの入力がURLでないときに使用されます。
ko: 주소 표시줄 입력이 URL이 아닐 때 사용됩니다.
ru: Используется, когда в адресной строке не URL.
uk: Використовується, коли введене в адресний рядок не є URL.
zh_hans: 地址栏输入不是 URL 时使用。
zh_hant: 網址列輸入不是 URL 時使用。

# settings.browser.searchSuggestions
source: Show Search Suggestions
ja: 検索候補を表示
ko: 검색 제안 표시
ru: Показывать поисковые подсказки
uk: Показувати пошукові підказки
zh_hans: 显示搜索建议
zh_hant: 顯示搜尋建議

# settings.browser.theme
source: Browser Theme
ja: ブラウザテーマ
ko: 브라우저 테마
ru: Тема браузера
uk: Тема браузера
zh_hans: 浏览器主题
zh_hant: 瀏覽器主題

# settings.browser.theme.subtitleForced
source: %@ forces that color scheme on compatible pages.
ja: %@は対応ページにそのカラースキームを強制します。
ko: %@은(는) 호환 페이지에 해당 색상 구성표를 강제 적용합니다.
ru: %@ принудительно применяет цветовую схему на совместимых страницах.
uk: %@ примушує цю колірну схему на сумісних сторінках.
zh_hans: %@ 在兼容页面上强制使用该配色方案。
zh_hant: %@ 會在相容的頁面強制套用該色彩配置。

# settings.browser.theme.subtitleSystem
source: System follows the app and macOS appearance.
ja: システムはアプリとmacOSの外観に従います。
ko: 시스템은 앱 및 macOS 외관을 따릅니다.
ru: Системная тема следует оформлению приложения и macOS.
uk: «Системна» стежить за виглядом застосунку та macOS.
zh_hans: 系统跟随应用和 macOS 的外观。
zh_hant: 「系統」會跟隨 App 和 macOS 外觀。

# settings.c11Skills.note
source: c11's skill files install into each agent's skill folder (Claude Code, Codex, …) with your approval. linked folders are shown as shared so removing once cannot silently affect another agent.
ja: c11 のスキルファイルは、承認の上で各エージェントのスキルフォルダ (Claude Code、Codex 等) にインストールされます。リンクされたフォルダは共有として表示され、一度の削除が他のエージェントに気付かれず影響することはありません。
ko: c11의 스킬 파일은 승인 후 각 에이전트의 스킬 폴더(Claude Code, Codex, …)에 설치됩니다. 연결된 폴더는 공유로 표시되어 한 번의 제거가 다른 에이전트에 조용히 영향을 미칠 수 없습니다.
ru: Файлы навыков c11 устанавливаются в папку навыков каждого агента (Claude Code, Codex, …) с вашего одобрения. Связанные папки отображаются как общие, чтобы одно удаление не могло незаметно затронуть другого агента.
uk: Файли навичок c11 встановлюються в папку навичок кожного агента (Claude Code, Codex, …) з вашого схвалення. Зв’язані папки відображаються як спільні, тож одне видалення не може непомітно вплинути на іншого агента.
zh_hans: c11 的技能文件在你批准后会安装到每个代理的技能文件夹中（Claude Code、Codex 等）。已链接的文件夹显示为共享，因此一次移除不会悄无声息地影响其他代理。
zh_hant: c11 的技能檔案在你批准後會安裝到每個代理的技能資料夾中（Claude Code、Codex 等）。已連結的資料夾顯示為共用，因此一次移除不會悄無聲息地影響其他代理。

# settings.chromeScale.preset.compact
source: Compact
ja: コンパクト
ko: 컴팩트
ru: Компактный
uk: Компактний
zh_hans: 紧凑
zh_hant: 緊湊

# settings.chromeScale.preset.extraLarge
source: Extra Large
ja: 特大
ko: 매우 크게
ru: Очень большой
uk: Дуже великий
zh_hans: 特大
zh_hant: 特大

# settings.chromeScale.preset.large
source: Large
ja: 大
ko: 크게
ru: Большой
uk: Великий
zh_hans: 大
zh_hant: 大

# settings.chromeScale.preset.standard
source: Default
ja: デフォルト
ko: 기본
ru: По умолчанию
uk: За замовчуванням
zh_hans: 默认
zh_hant: 預設

# settings.chromeScale.subtitle
source: Scale c11 sidebar text and surface tab strip without changing terminal font size.
ja: ターミナルのフォントサイズを変更せずに、c11サイドバーのテキストとサーフェスのタブストリップをスケーリングします。
ko: 터미널 글꼴 크기를 변경하지 않고 c11 사이드바 텍스트와 surface 탭 스트립을 스케일링합니다.
ru: Масштабирует текст боковой панели c11 и полосу вкладок surface без изменения размера шрифта терминала.
uk: Масштабує текст бічної панелі c11 та смугу вкладок surface без зміни розміру шрифту терміналу.
zh_hans: 在不更改终端字体大小的情况下,缩放 c11 侧边栏文本和 surface 标签栏。
zh_hant: 在不更改終端字型大小的情況下,縮放 c11 側邊欄文字和 surface 標籤列。

# settings.chromeScale.title
source: App Chrome UI Scale
ja: アプリクロームUIスケール
ko: 앱 크롬 UI 스케일
ru: Масштаб UI хрома приложения
uk: Масштаб UI хрому застосунку
zh_hans: 应用 Chrome UI 缩放
zh_hant: 應用 Chrome UI 縮放

# settings.dataPrivacy.telemetry.subtitle
source: Anonymous crash and usage data leaves this Mac only when on.
ja: オンのときだけ、匿名のクラッシュデータと使用状況データがこのMacから送信されます。
ko: 켜져 있을 때만 익명 충돌 및 사용 데이터가 이 Mac을 떠납니다.
ru: Анонимные данные о сбоях и использовании покидают этот Mac только при включении.
uk: Анонімні дані про збої й використання залишають цей Mac лише коли ввімкнено.
zh_hans: 仅在开启时，匿名崩溃和使用数据才会离开本 Mac。
zh_hant: 開啟後，匿名當機和使用資料才會傳出此 Mac。

# settings.defaultAgent.command.help
source: the shell line that runs when you click A. edit it like any other command.
ja: A をクリックしたときに実行されるシェル行です。通常のコマンドと同じように編集できます。
ko: A를 클릭하면 실행되는 셸 라인입니다. 다른 명령처럼 편집하세요.
ru: Строка оболочки, выполняемая при нажатии A. Редактируйте её как любую другую команду.
uk: Рядок оболонки, який запускається, коли ви натискаєте A. Редагуйте його як будь-яку іншу команду.
zh_hans: 点击 A 时运行的 shell 命令行。可以像编辑其他命令一样编辑它。
zh_hant: 點擊 A 時執行的 shell 指令行。可以像編輯其他指令一樣編輯它。

# settings.defaultAgent.command.help.format
source: the shell line that runs when we launch the %@ agent. you can include any parameters to match your specification.
ja: %@ エージェントを起動するときに実行されるシェル行です。仕様に合わせて任意のパラメータを含められます。
ko: %@ 에이전트를 실행할 때 실행되는 셸 라인입니다. 사양에 맞춰 어떤 매개변수든 포함할 수 있습니다.
ru: Строка оболочки, выполняемая при запуске агента %@. Можете включить любые параметры согласно вашей спецификации.
uk: Рядок оболонки, який запускається, коли ми запускаємо агента %@. Ви можете включити будь-які параметри відповідно до ваших вимог.
zh_hans: 启动 %@ 代理时运行的 shell 命令行。可以包含任意符合规范的参数。
zh_hant: 啟動 %@ 代理時執行的 shell 指令行。可以包含任意符合規範的參數。

# settings.defaultAgent.command.label
source: command
ja: コマンド
ko: 명령
ru: команда
uk: команда
zh_hans: 命令
zh_hant: 指令

# settings.defaultAgent.customCommand.label
source: Custom command
ja: カスタムコマンド
ko: 사용자 지정 명령
ru: Пользовательская команда
uk: Користувацька команда
zh_hans: 自定义命令
zh_hant: 自訂指令

# settings.defaultAgent.cwd.fixed
source: Fixed path
ja: 固定パス
ko: 고정 경로
ru: Фиксированный путь
uk: Фіксований шлях
zh_hans: 固定路径
zh_hant: 固定路徑

# settings.defaultAgent.cwd.inherit
source: Inherit from parent pane
ja: 親ペインから継承
ko: 상위 패널에서 상속
ru: Унаследовать от родительской панели
uk: Успадковано від батьківської панелі
zh_hans: 继承自父窗格
zh_hant: 由父窗格繼承

# settings.defaultAgent.cwd.label
source: Working directory
ja: 作業ディレクトリ
ko: 작업 디렉터리
ru: Рабочий каталог
uk: Робочий каталог
zh_hans: 工作目录
zh_hant: 工作目錄

# settings.defaultAgent.env.disclosure
source: environment overrides — advanced users only
ja: 環境変数の上書き — 上級者専用
ko: 환경 변수 재정의 — 고급 사용자 전용
ru: переопределения окружения — только для опытных пользователей
uk: перевизначення середовища — лише для досвідчених
zh_hans: 环境变量覆盖 — 仅限高级用户
zh_hant: 環境變數覆寫 — 僅限進階使用者

# settings.defaultAgent.env.help
source: one KEY=value per line. injected into the agent's process. leave empty unless you know why you want it.
ja: 1 行に 1 つの KEY=value。エージェントのプロセスに注入されます。理由がなければ空のままにしてください。
ko: 한 줄에 하나의 KEY=value. 에이전트 프로세스에 주입됩니다. 이유를 모르면 비워 두세요.
ru: Один KEY=value в строке. Передаётся в процесс агента. Оставьте пустым, если не знаете, зачем это нужно.
uk: Один KEY=value на рядок. Інжектується в процес агента. Залиште порожнім, якщо не знаєте, навіщо це потрібно.
zh_hans: 每行一个 KEY=value。注入到代理进程中。如果不清楚原因，请保持为空。
zh_hant: 每行一個 KEY=value。注入到代理程序中。如果不清楚原因，請保持空白。

# settings.defaultAgent.extraArgs.label
source: Extra arguments
ja: 追加の引数
ko: 추가 인자
ru: Дополнительные аргументы
uk: Додаткові аргументи
zh_hans: 额外参数
zh_hant: 額外參數

# settings.defaultAgent.fixedCwd.label
source: Fixed path
ja: 固定パス
ko: 고정 경로
ru: Фиксированный путь
uk: Фіксований шлях
zh_hans: 固定路径
zh_hant: 固定路徑

# settings.defaultAgent.initialPrompt.help
source: optional. typed into the agent right after it boots.
ja: 省略可。エージェントの起動直後にエージェントに入力されます。
ko: 선택. 에이전트가 부팅된 직후에 에이전트에 입력됩니다.
ru: Необязательно. Вводится в агент сразу после запуска.
uk: Необов’язково. Вводиться в агент одразу після запуску.
zh_hans: 可选。代理启动后立即输入到代理中。
zh_hant: 選填。代理啟動後立即輸入到代理中。

# settings.defaultAgent.initialPrompt.label
source: initial prompt
ja: 初期プロンプト
ko: 초기 프롬프트
ru: начальный запрос
uk: початковий запит
zh_hans: 初始提示词
zh_hant: 初始提示

# settings.defaultAgent.model.label
source: Model
ja: モデル
ko: 모델
ru: Модель
uk: Модель
zh_hans: 模型
zh_hant: 模型

# settings.defaultAgent.note
source: the A button on every pane launches this. new terminal still opens bash. drop a `.c11/agents.json` in any repo to override these settings for terminals opened there.
ja: 各ペインの A ボタンはこれを起動します。新規ターミナルは引き続き bash を開きます。これらの設定をリポジトリ単位で上書きするには `.c11/agents.json` を置きます。
ko: 각 패널의 A 버튼이 이것을 실행합니다. 새 터미널은 여전히 bash를 엽니다. 그곳에서 열리는 터미널의 설정을 재정의하려면 어떤 저장소에든 `.c11/agents.json`을 넣으세요.
ru: Кнопка A на каждой панели запускает его. Новый терминал по-прежнему открывает bash. Положите `.c11/agents.json` в любой репозиторий, чтобы переопределить эти настройки для терминалов, открытых там.
uk: Кнопка A на кожній панелі запускає це. Новий термінал, як і раніше, відкриває bash. Покладіть `.c11/agents.json` у будь-який репозиторій, щоб перевизначити ці налаштування для терміналів, відкритих у ньому.
zh_hans: 每个窗格上的 A 按钮启动它。新建终端仍打开 bash。在任意仓库放入 `.c11/agents.json` 即可覆盖在该处打开的终端的设置。
zh_hant: 每個窗格上的 A 按鈕啟動它。新增終端機仍開啟 bash。在任一儲存庫放入 `.c11/agents.json` 即可覆寫在該處開啟的終端機的設定。

# settings.defaultAgent.picker.label
source: default agent
ja: デフォルトエージェント
ko: 기본 에이전트
ru: агент по умолчанию
uk: типовий агент
zh_hans: 默认代理
zh_hant: 預設代理

# settings.defaultAgent.preview.bash
source: (bash — no startup command)
ja: (bash — 起動コマンドなし)
ko: (bash — 시작 명령 없음)
ru: (bash — без команды запуска)
uk: (bash — без команди запуску)
zh_hans: (bash — 无启动命令)
zh_hant: (bash — 無啟動指令)

# settings.defaultAgent.preview.label
source: Command preview
ja: コマンドプレビュー
ko: 명령 미리보기
ru: Предпросмотр команды
uk: Попередній перегляд команди
zh_hans: 命令预览
zh_hant: 指令預覽

# settings.defaultAgent.reset
source: reset agent to defaults
ja: エージェントをデフォルトに戻す
ko: 에이전트를 기본값으로 재설정
ru: сбросить агента к значениям по умолчанию
uk: скинути агента до типових
zh_hans: 将代理重置为默认值
zh_hant: 將代理重設為預設值

# settings.defaultAgent.subheading.format
source: Agent %@
ja: %@ エージェント
ko: %@ 에이전트
ru: Агент %@
uk: Агент %@
zh_hans: %@ 代理
zh_hant: %@ 代理

# settings.defaultAgent.type.bash
source: Bash (no agent)
ja: Bash (エージェントなし)
ko: Bash (에이전트 없음)
ru: Bash (без агента)
uk: Bash (без агента)
zh_hans: Bash（无代理）
zh_hant: Bash（無代理）

# settings.defaultAgent.type.custom
source: Custom
ja: カスタム
ko: 사용자 지정
ru: Пользовательский
uk: Користувацька
zh_hans: 自定义
zh_hant: 自訂

# settings.defaultAgent.type.label
source: Agent type
ja: エージェントの種類
ko: 에이전트 유형
ru: Тип агента
uk: Тип агента
zh_hans: 代理类型
zh_hant: 代理類型

# settings.defaultTerminalAgent.note
source: Applied to every new terminal surface (menu, keyboard, socket). Use “New Bash Terminal” to bypass for a single surface. Per-project overrides live in `.c11/agents.json`; per-workspace override is the metadata key `default_agent_use_bash` (set with `c11 set-metadata`). Distinct from the per-pane “A” launcher button below.
ja: すべての新規ターミナル面 (メニュー、キーボード、ソケット) に適用されます。1 つの面だけ回避するには「新規 Bash ターミナル」を使用してください。プロジェクト単位の上書きは `.c11/agents.json` に、ワークスペース単位の上書きはメタデータキー `default_agent_use_bash` (`c11 set-metadata` で設定) を使用します。下の「A」ペイン起動ボタンとは別物です。
ko: 모든 새 터미널 표면(메뉴, 키보드, 소켓)에 적용됩니다. 한 표면만 우회하려면 “새 Bash 터미널”을 사용하세요. 프로젝트별 재정의는 `.c11/agents.json`, 워크스페이스별 재정의는 메타데이터 키 `default_agent_use_bash` (`c11 set-metadata`로 설정)입니다. 아래의 패널별 “A” 런처 버튼과는 별개입니다.
ru: Применяется к каждому новому терминалу (меню, клавиатура, сокет). Используйте «Новый Bash-терминал», чтобы обойти для одного. Переопределения уровня проекта — в `.c11/agents.json`; уровня рабочей области — ключ метаданных `default_agent_use_bash` (задаётся через `c11 set-metadata`). Отдельно от кнопки «A» под этим разделом.
uk: Застосовується до кожного нового термінала (меню, клавіатура, сокет). Використайте «Новий Bash-термінал», щоб обійти лише для одного. Перевизначення для проєкту — у `.c11/agents.json`; для робочої області — ключ метаданих `default_agent_use_bash` (встановлюйте через `c11 set-metadata`). Окремо від кнопки «A» нижче.
zh_hans: 应用于每个新终端表面（菜单、键盘、套接字）。使用“新建 Bash 终端”可对单个表面绕过。项目级覆盖位于 `.c11/agents.json`；工作区级覆盖是元数据键 `default_agent_use_bash`（用 `c11 set-metadata` 设置）。与下方每窗格的“A”启动按钮不同。
zh_hant: 套用到每個新的終端機介面（選單、鍵盤、Socket）。使用「新增 Bash 終端機」可針對單一介面繞過。專案層級覆寫位於 `.c11/agents.json`；工作區層級覆寫是中繼資料鍵 `default_agent_use_bash`（用 `c11 set-metadata` 設定）。與下方每窗格的「A」啟動按鈕不同。
